#Pandas Dataframe

#librerias

In [38]:
import pandas as pd
import numpy as np

In [39]:
pd.__version__

'1.5.0'

In [40]:
np.__version__

'1.23.3'

#Creacion de datos de prueba

In [41]:
filas = ["Ventas 1","Ventas 2","Ventas 3"]
columnas = ["zona 1","zona 2","zona 3"]
datos = np.random.randint(100,200,9)

In [42]:
filas

['Ventas 1', 'Ventas 2', 'Ventas 3']

In [43]:
columnas

['zona 1', 'zona 2', 'zona 3']

In [44]:
datos

array([140, 171, 166, 137, 114, 180, 110, 165, 109])

In [45]:
datos = datos.reshape(3,3)

In [46]:
datos

array([[140, 171, 166],
       [137, 114, 180],
       [110, 165, 109]])

#Crear el dataframe

In [47]:
dataframe = pd.DataFrame(data = datos, index = filas, columns = columnas, dtype = float)

In [48]:
dataframe

          zona 1  zona 2  zona 3
Ventas 1   140.0   171.0   166.0
Ventas 2   137.0   114.0   180.0
Ventas 3   110.0   165.0   109.0

#operadoraciones a un dataframe

In [49]:
dataframe +2

          zona 1  zona 2  zona 3
Ventas 1   142.0   173.0   168.0
Ventas 2   139.0   116.0   182.0
Ventas 3   112.0   167.0   111.0

#Aceder a una columna

In [50]:
dataframe["zona 1"]

Ventas 1    140.0
Ventas 2    137.0
Ventas 3    110.0
Name: zona 1, dtype: float64

In [51]:
dataframe[["zona 1","zona 2"]] #seleccionar varias columnas

          zona 1  zona 2
Ventas 1   140.0   171.0
Ventas 2   137.0   114.0
Ventas 3   110.0   165.0

In [52]:
dataframe["zona 1"] < 170

Ventas 1    True
Ventas 2    True
Ventas 3    True
Name: zona 1, dtype: bool

In [54]:
dataframe.loc[(dataframe["zona 1"] < 150)]

          zona 1  zona 2  zona 3
Ventas 1   140.0   171.0   166.0
Ventas 2   137.0   114.0   180.0
Ventas 3   110.0   165.0   109.0